import sqlite3

# создание базы данных и таблицы
conn = sqlite3.connect('library.db')
cur = conn.cursor()



cur.execute('''CREATE TABLE IF NOT EXISTS users
             (user_id INTEGER PRIMARY KEY AUTOINCREMENT,
             name TEXT,
             rang INTEGER,
             phone TEXT)''')

# Вставка данных в таблицу books

contents = [
    (1, 'Букин И', 1, '89053213547'), (2, 'Воронченко Н', 3, '89053463547'),
    (3, 'Волгин Д', 2, '89053214311'),
    (4, 'Даутов Н', 3, '89052413433'), (5, 'Евтеев В', 1, '89342215321'), (6, 'Жуков В', 2, '89053211363'),
    (7, 'Заморин Д', 2, '89053213547'),
    (8, 'Колесников Г', 2, '89085213134'), (9, 'Мухамедьянов И', 1, '89000947372'),
    (10, 'Никитский В', 1, '89000988807'),
    (12, 'Протаский К', 1, '890567413234'),
    (12, 'Пулейкис Я', 1, '89046213544'), (13, 'Рублёв П', 2, '89064219686'),
    (14, 'Сафаров А', 1, '89053213547'), (15, 'Уваров Д', 2, '89463214634'),
    (16, 'Финогенов В', 3, '89053216484'),
    (17, 'Черкашин И', 2, '89052211347'),
    (18, 'Чернов Е', 3, '8905422433'), (19, 'Шалашов К', 1, '89053214421')
]
cur.executemany("INSERT OR REPLACE INTO users VALUES(?, ?, ?, ?);", contents)

# сохранение изменений и закрытие соединени
conn.commit()
conn.close()
