import sqlite3

# создание базы данных и таблицы
conn = sqlite3.connect('library.db')
cur = conn.cursor()

cur.execute('''CREATE TABLE IF NOT EXISTS books
             (book_id INTEGER PRIMARY KEY,
             title TEXT,
             author TEXT,
             genre TEXT,
             year INTEGER NOT NULL, 
             available INTEGER )''')

# Вставка данных в таблицу books
conn.execute("INSERT OR REPLACE INTO books (book_id, title, author, genre, year, available) \
              VALUES (1, 'Война и мир', 'Лев Толстой', 'Роман', 1868, 1)")

conn.execute("INSERT OR REPLACE INTO books (book_id, title, author, genre, year, available) \
              VALUES (2, 'Преступление и наказание', 'Федор Достоевский', 'Роман', 1866, 1)")

conn.execute("INSERT OR REPLACE INTO books (book_id, title, author, genre, year, available) \
              VALUES (3, 'Мастер и Маргарита', 'Михаил Булгаков', 'Роман', 1967, 1)")
contents1 = [
    (4, '1984', 'Джордж Оруэлл', 'Антиутопия', 1949, 1), (5, 'Анна Карнеина', "Лев Толстой", "Роман", 1877, 1),
    (6, "Маленький принц", "Антуан де Сент-Экзюпери", "Сказка", 1943, 1),
    (7, "Мертвые души", "Николай Гоголь", "Поэма", 1842, 1),
    (8, "Властелин колец", "Дж. Толкин", "Фэнтези", 1954, 1), (9, "Унесенный ветром", "Маргарет Митчел", "Роман", 1936, 1),
    (10, "Финансист", "Теодор Драйзер", "Роман", 1912, 1), (11, "О дивный новый мир", "Олдос Хаксли", "Антиутопия", 1931, 1)
]
cur.executemany("INSERT OR REPLACE INTO books VALUES(?, ?, ?, ?, ?, ?);", contents1)
contents2 = [(12, "Тихий дон", "Михал Шолохов", "Роман-эпопея", 1940, 1),
             (13, "Братья карамазовы", "Федор Достоевский", "Роман-трагедия", 1880, 1),
             (14, "Евгений Онегин", "Алесандр Пушкин", "Роман в стихах", 1883, 1),
             (15, "Герой нашего времени", "Михаил Лермонтов", "Роман в стихах", 1840, 1),
             (16, "Демон", "Михаил Лермонтов", "Поэма", 1839, 1),
             (17, "Капитанская дочка", "Александр Пушкин", "Роман", 1835, 1),
             (18, "Идиот", "Федор Достоевский", "Роман", 1868, 1), (19, "Дубровский", "Александр Пушкин", "Новелла", 1832, 1),
             (20, "Ревизор", "Николай Гоголь", "Комедия", 1836, 1), (21, "12 стульев", "Евгений Петров", "Комедия", 1928, 1),
             (22, "Собачье сердце", "Михаил Булгаков", "Роман", 1925, 1),
             (23, "Белая гвардия", "Михаил Булгаков", "Роман", 1925, 1),
             (24, "Доктор Живаго", "Борис Пастернак", "Роман", 1957, 1),
             (25, "Жизнь или судьба", "Василий Гроссман", "Роман", 1960, 1),
             (26, "Мастер-класс", "Ирина Берг", "Роман", 2005, 1), (27, "Остров Сахалин", "Антон Чехов", "Рассказ", 1895, 1),
             (28, "Пиковая дама", "Александр Пушкин", "Повесть", 1834, 1),
             (29, "Сказка о царе Салтане", "Александр Пушкин", "Сказка", 1831, 1),
             (30, "Ночной дозор", "Сергей Лукьяненко", "Ужасы", 1998, 1)]
cur.executemany("INSERT OR REPLACE INTO books VALUES(?, ?, ?, ?, ?, ?);", contents2)
#новый столбез наличия книг
# cur.execute('ALTER TABLE books ADD availability TEXT')
# cur.execute('ALTER TABLE books ALTER COLUMN availability INTEGER')
# сохранение изменений и закрытие соединения
conn.commit()
conn.close()
